<?php
// День первый: Философия ООП

$a = 5; 
$b = 7;

/* $a -> [ 5 ] -- храниться в памяти
 * $b -> [ 7 ] -- храниться в памяти
 * 
 * $b = $a; -- копия по значению
 * 
 * $a -> [ 5 ]
 * $b -> [ 5 ]
 * 
 * $a = 10;
 * 
 * $a -> [ 10 ]
 * $b -> [ 5 ]
 * ----------------------------------------------
 * 
 * $a = 5;
 * $b = 7;
 * 
 * Перем     Ссылка       Значение
 * $a        ->           [ 5 ]
 * $b        ->           [ 7 ]
 * 
 * $b = &$a; -- копия по ссылке
 * 
 * $a -> [ 5 ]
 * $b / -- скопировали ссылку
 * 
 * $b = 10;
 * echo $a; // 10
 * 
 */